In [1]:
import pandas as pd

In [3]:
instagram = "../data/instagram/"
atual = pd.read_excel(instagram+"MainDataset.xlsx")
atual.head()

,Name,No. Posts,No. Followers,No. Following,No. Likes Ex 10 post,No. Likes Ex 11 post,No. Likes Ex 12 post,No. self posts from ex 9 posts,Sex,Date
0,User_1,486,279,19,15,10,17,0,m,Mar 14 2017
1,User_2,401,5509,342,360,440,428,0,f,NaN
2,User_3,463,453,293,65,68,149,4,f,NaN
3,User_4,154,1231,1477,53,22,35,3,m,NaN
4,User_5,786,9620,421,623,1299,544,0,m,NaN

In [5]:
atual["Date"].isna().sum()

802

In [6]:
atual.shape

(818, 10)